import sys
input = sys.stdin.readline

N, M = map(int, input().split())
box = [list(map(int, input().split())) for _ in range(N)]
# 모든 경우의 수를 설정해둔다.
tet = [[[0,0], [0,1], [0,2], [0,3]], # ㅡ
		 [[0,0], [1,0], [2,0], [3,0]],

		 [[0,0], [0,1], [1,0], [1,1]], # ㅁ

		 [[0,0], [1,0], [2,0], [2,1]], # L
		 [[0,0], [1,0], [2,0], [0,1]],
		 [[0,0], [0,1], [0,2], [1,2]],
		 [[1,0], [1,1], [1,2], [0,2]],

		 [[0,1], [1,1], [2,1], [2,0]],
		 [[0,0], [0,1], [1,1], [2,1]],
		 [[0,0], [1,0], [1,1], [1,2]], 
		 [[0,0], [0,1], [0,2], [1,0]],

		 [[0,0], [0,1], [0,2], [1,1]],
		 [[0,1], [1,1], [2,1], [1,0]],
		 [[0,0], [1,0], [1,1], [2,0]],
		 [[0,1], [1,0], [1,1], [1,2]],

		 [[0,0], [1,0], [1,1], [2,1]],
		 [[1,1], [0,1], [0,2], [1,0]],
		 [[0,1], [1,1], [1,0], [2,0]],
		 [[0,0], [0,1], [1,1], [1,2]]] 

ans = 0
# N*M 의 모든 (col, row)에 대해서 위의 tetris 19개를 테스트한다.
for col in range(N):
	for row in range(M):
		for i in range(19):
			sum = 0
			for j in range(4):
				x_val, y_val = col+tet[i][j][0], row+tet[i][j][1]
				if x_val< 0 or x_val>=N or y_val<0 or y_val>=M:
					break
				sum += box[x_val][y_val]
            # 구한 값과 원래 값 중에서 큰 값이 정답 
			ans = max(ans, sum)		
print(ans)

